

var npcConfig = {

    '阿尔萨斯·米奈希尔': {
        items: ['达贡之神力1级', '治疗药膏'],
        'imgSrc': 'm_01',
        words: '我可是货真价实,童叟无欺.',
    },
    '提里奥·弗丁': {
        items: ['闪避护符', '治疗药膏'],
        'imgSrc': 'f_01',
        words: '有话快说',
    },
    '雷克萨': {
        items: ['圆盾', '治疗药膏'],
        'imgSrc': 'm_02',
        words: '愿风~~，指引你的道路~~~',
    },
    '萨尔': {
        items: ['治疗药膏'],
        'imgSrc': 'f_02',
        words: '我能为你做些什么',
    },
    '玛法里奥·怒风': {
        items: ['水晶剑', '治疗药膏'],
        'imgSrc': 'm_03',
        words: '我的货物很不错哦',
    },
    '耐奥祖': {
        items: ['回复戒指', '治疗药膏'],
        'imgSrc': 'f_03',
        words: '我和你有商业往来吗',
    },
    '奥格瑞姆': {
        items: ['治疗指环', '治疗药膏'],
        'imgSrc': 'm_04',
        words: '永恒的太阳指引着我们',
    },
    '泰兰德': {
        items: ['大炮', '治疗药膏'],
        'imgSrc': 'f_04',
        words: '你需要帮助吗?',
    },
    '欺诈者基尔加丹': {
        items: ['先锋盾', '治疗药膏'],
        'imgSrc': 'm_04',
        words: '你能活这么久真是个奇迹',
    },
    '污染者阿克蒙德': {
        items: ['达贡之神力2级', '治疗药膏'],
        'imgSrc': 'f_04',
        words: '我有生意要做',
    },

    'VIP商店': {
        items: ['直刀','铁刀','钢刀','半月刀','精钢刀','雁月刀','赤血刀','重曲刀'],
        'imgSrc': 'f_01',
        words: '这些道具可是极品中的极品',
    },
}
module.exports = npcConfig
